{"backend": "tensorflow", "config": [{"config": {"bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_first", "dtype": "float32", "name": "conv2d_1", "strides": [1, 1], "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true, "bias_regularizer": null, "activation": "relu", "kernel_size": [5, 5], "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "same", "batch_input_shape": [null, 5, 4, 13], "filters": 20, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "data_format": "channels_first", "name": "max_pooling2d_1", "strides": [2, 2], "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_first", "dtype": "float32", "name": "conv2d_2", "strides": [1, 1], "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true, "bias_regularizer": null, "activation": "relu", "kernel_size": [5, 5], "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "same", "batch_input_shape": [null, 20, 12, 12], "filters": 20, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "data_format": "channels_first", "name": "max_pooling2d_2", "strides": [2, 2], "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "rate": 0.2, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_1", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true, "bias_regularizer": null, "activation": "sigmoid", "units": 100, "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_2", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true, "bias_regularizer": null, "activation": "linear", "units": 1, "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.8"}