{"keras_version": "2.0.8", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"activation": "relu", "batch_input_shape": [null, 5, 4, 13], "padding": "same", "kernel_size": [5, 5], "dtype": "float32", "dilation_rate": [1, 1], "filters": 20, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_5", "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "data_format": "channels_first"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_5", "data_format": "channels_first", "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"activation": "relu", "batch_input_shape": [null, 20, 12, 12], "padding": "same", "kernel_size": [5, 5], "dtype": "float32", "dilation_rate": [1, 1], "filters": 20, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_6", "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "bias_regularizer": null, "data_format": "channels_first"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_6", "data_format": "channels_first", "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "rate": 0.2}}, {"class_name": "Flatten", "config": {"name": "flatten_3", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "sigmoid", "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_5", "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "units": 100}}, {"class_name": "Dense", "config": {"activation": "linear", "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_6", "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "units": 1}}]}