{"class_name": "Sequential", "keras_version": "2.0.8", "config": [{"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_1", "trainable": true, "batch_input_shape": [null, 4, 4, 13], "dtype": "float32", "padding": [[6, 7], [2, 2]], "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "activation": "relu", "kernel_constraint": null, "strides": [1, 1], "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "data_format": "channels_first", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "dilation_rate": [1, 1], "kernel_size": [5, 5], "filters": 64, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "activation": "relu", "kernel_constraint": null, "strides": [1, 1], "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "data_format": "channels_first", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "dilation_rate": [1, 1], "kernel_size": [5, 5], "filters": 64, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "activation": "relu", "kernel_constraint": null, "strides": [1, 1], "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "data_format": "channels_first", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "dilation_rate": [1, 1], "kernel_size": [5, 5], "filters": 64, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "activation": "relu", "kernel_constraint": null, "strides": [1, 1], "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "data_format": "channels_first", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "dilation_rate": [1, 1], "kernel_size": [5, 5], "filters": 64, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "data_format": "channels_first"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.5}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "activation": "linear", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "units": 1, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null}}], "backend": "tensorflow"}