{"backend": "tensorflow", "config": [{"config": {"trainable": true, "batch_input_shape": [null, 4, 4, 13], "dtype": "float32", "padding": [[6, 7], [2, 2]], "data_format": "channels_first", "name": "zero_padding2d_1"}, "class_name": "ZeroPadding2D"}, {"config": {"filters": 64, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "padding": "same", "data_format": "channels_first", "use_bias": true, "name": "conv1", "kernel_size": [5, 5], "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "activation": "relu", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"filters": 64, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "padding": "same", "data_format": "channels_first", "use_bias": true, "name": "conv2", "kernel_size": [5, 5], "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "activation": "relu", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"filters": 64, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "padding": "same", "data_format": "channels_first", "use_bias": true, "name": "conv3", "kernel_size": [5, 5], "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "activation": "relu", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"filters": 64, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "padding": "same", "data_format": "channels_first", "use_bias": true, "name": "conv4", "kernel_size": [5, 5], "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "activation": "relu", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "rate": 0.5, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"bias_regularizer": null, "use_bias": true, "name": "dense_1", "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "units": 1, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "keras_version": "2.0.8", "class_name": "Sequential"}