{"config": [{"config": {"batch_input_shape": [null, 4, 4, 13], "dtype": "float32", "name": "zero_padding2d_1", "trainable": true, "padding": [[6, 7], [2, 2]], "data_format": "channels_first"}, "class_name": "ZeroPadding2D"}, {"config": {"strides": [1, 1], "filters": 64, "name": "conv2d_1", "bias_constraint": null, "use_bias": true, "kernel_size": [5, 5], "data_format": "channels_first", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"strides": [1, 1], "filters": 64, "name": "conv2d_2", "bias_constraint": null, "use_bias": true, "kernel_size": [5, 5], "data_format": "channels_first", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_1", "trainable": true, "padding": "valid", "data_format": "channels_first"}, "class_name": "MaxPooling2D"}, {"config": {"strides": [1, 1], "filters": 64, "name": "conv2d_3", "bias_constraint": null, "use_bias": true, "kernel_size": [5, 5], "data_format": "channels_first", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"strides": [1, 1], "filters": 64, "name": "last_conv", "bias_constraint": null, "use_bias": true, "kernel_size": [5, 5], "data_format": "channels_first", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_2", "trainable": true, "padding": "valid", "data_format": "channels_first"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "name": "dense_1", "use_bias": true, "bias_regularizer": null, "units": 1, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear"}, "class_name": "Dense"}], "keras_version": "2.0.8", "backend": "tensorflow", "class_name": "Sequential"}