{"backend": "tensorflow", "keras_version": "2.0.8", "class_name": "Sequential", "config": [{"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_1", "batch_input_shape": [null, 4, 4, 13], "trainable": true, "data_format": "channels_first", "padding": [[6, 7], [2, 2]], "dtype": "float32"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "strides": [1, 1], "kernel_size": [5, 5], "padding": "same", "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "relu", "dilation_rate": [1, 1], "bias_regularizer": null, "trainable": true, "data_format": "channels_first", "kernel_constraint": null, "bias_constraint": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "strides": [1, 1], "kernel_size": [5, 5], "padding": "same", "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "relu", "dilation_rate": [1, 1], "bias_regularizer": null, "trainable": true, "data_format": "channels_first", "kernel_constraint": null, "bias_constraint": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "strides": [2, 2], "trainable": true, "data_format": "channels_first", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "strides": [1, 1], "kernel_size": [5, 5], "padding": "same", "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "relu", "dilation_rate": [1, 1], "bias_regularizer": null, "trainable": true, "data_format": "channels_first", "kernel_constraint": null, "bias_constraint": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "strides": [1, 1], "kernel_size": [5, 5], "padding": "same", "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "relu", "dilation_rate": [1, 1], "bias_regularizer": null, "trainable": true, "data_format": "channels_first", "kernel_constraint": null, "bias_constraint": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_2", "strides": [2, 2], "trainable": true, "data_format": "channels_first", "padding": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.5}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "units": 1, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}